/* automatically generated by rust-bindgen */

pub type __uint64_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct c4s_diagnostic_position {
    pub file: *const ::std::os::raw::c_char,
    pub function: *const ::std::os::raw::c_char,
    pub line: u64,
    pub column: u64,
    pub length: u64,
    pub valid: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_c4s_diagnostic_position() {
    assert_eq!(
        ::std::mem::size_of::<c4s_diagnostic_position>(),
        48usize,
        concat!("Size of: ", stringify!(c4s_diagnostic_position))
    );
    assert_eq!(
        ::std::mem::align_of::<c4s_diagnostic_position>(),
        8usize,
        concat!("Alignment of ", stringify!(c4s_diagnostic_position))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<c4s_diagnostic_position>())).file as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(c4s_diagnostic_position),
            "::",
            stringify!(file)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<c4s_diagnostic_position>())).function as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(c4s_diagnostic_position),
            "::",
            stringify!(function)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<c4s_diagnostic_position>())).line as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(c4s_diagnostic_position),
            "::",
            stringify!(line)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<c4s_diagnostic_position>())).column as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(c4s_diagnostic_position),
            "::",
            stringify!(column)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<c4s_diagnostic_position>())).length as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(c4s_diagnostic_position),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<c4s_diagnostic_position>())).valid as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(c4s_diagnostic_position),
            "::",
            stringify!(valid)
        )
    );
}
pub type c4s_errorhandlerfn = ::std::option::Option<
    unsafe extern "C" fn(
        ctx: *mut ::std::os::raw::c_void,
        arg1: *const ::std::os::raw::c_char,
        arg2: c4s_diagnostic_position,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct c4s_errorhandlers {
    pub errors: c4s_errorhandlerfn,
    pub warnings: c4s_errorhandlerfn,
    pub ctx: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_c4s_errorhandlers() {
    assert_eq!(
        ::std::mem::size_of::<c4s_errorhandlers>(),
        24usize,
        concat!("Size of: ", stringify!(c4s_errorhandlers))
    );
    assert_eq!(
        ::std::mem::align_of::<c4s_errorhandlers>(),
        8usize,
        concat!("Alignment of ", stringify!(c4s_errorhandlers))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<c4s_errorhandlers>())).errors as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(c4s_errorhandlers),
            "::",
            stringify!(errors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<c4s_errorhandlers>())).warnings as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(c4s_errorhandlers),
            "::",
            stringify!(warnings)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<c4s_errorhandlers>())).ctx as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(c4s_errorhandlers),
            "::",
            stringify!(ctx)
        )
    );
}
extern "C" {
    pub fn c4s_runfile(
        filename: *const ::std::os::raw::c_char,
        handlers: *mut c4s_errorhandlers,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn c4s_runstring(
        script: *const ::std::os::raw::c_char,
        handlers: *mut c4s_errorhandlers,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn c4s_checkfile(
        filename: *const ::std::os::raw::c_char,
        handlers: *mut c4s_errorhandlers,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn c4s_checkstring(
        script: *const ::std::os::raw::c_char,
        handlers: *mut c4s_errorhandlers,
    ) -> ::std::os::raw::c_int;
}
